app/views/lists/show.html.erb

SELECT `sections`.* FROM `sections` WHERE `sections`.`list_id` = 1
---

<%if @list.sections.length > 0%>