app/controllers/access_controller.rb

  def attempt_login
  	if params[:username].present? && params[:password].present?
  		found_user = User.where(:user_name => params[:username]).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_name` = 'jwaters' ORDER BY `users`.`id` ASC LIMIT 1