app/controllers/lists_controller.rb

  def index
    @lists = User.find(session[:user_id]).lists
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `lists`.* FROM `lists` INNER JOIN `lists_users` ON `lists`.`id` = `lists_users`.`list_id` WHERE `lists_users`.`user_id` = 1

  def show
    @list = List.find(params[:id])
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def create
    @list = List.new(list_params)
    if @list.save
      User.find(session[:user_id]).lists << @list
---
INSERT INTO `lists` (`name`, `created_at`, `updated_at`) VALUES ('newest list', '2017-07-09 00:42:12', '2017-07-09 00:42:12')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def edit
    @list = List.find(params[:id])
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def update
    @list = List.find(params[:id])
    if @list.update_attributes(list_params)
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
UPDATE `lists` SET `name` = 'first list edited', `updated_at` = '2017-07-09 01:57:39' WHERE `lists`.`id` = 1

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 4