app/controllers/users_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `email`, `user_name`, `created_at`, `updated_at`, `password_digest`) VALUES ('James', 'Waters', 'jwaters627@gmail.com', 'jwaters627', '2017-07-09 19:43:56', '2017-07-09 19:43:56', '$2a$10$GEO6kolFvqchCWRVeytXR.3my6L8wvKOLUbSwdNOKfEAH/dZ4dH32')
---
  def create
    @user = User.new(user_params)
    if @user.save